<?xml version="1.0" ?>
<net name="torch-jit-export" version="11">
	<layers>
		<layer id="0" name="input" type="Parameter" version="opset1">
			<data shape="1,3,216,384" element_type="f32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="input"/>
				<attribute name="old_api_map_element_type" version="0" value="f16"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="input">
					<dim>1</dim>
					<dim>3</dim>
					<dim>216</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Constant_4109_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 3, 1, 1" offset="0" size="6"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Constant_4109" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="Constant_4109"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Subtract_4110" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Subtract_4110"/>
				<attribute name="preprocessing" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>216</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>216</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Constant_8690_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="32, 3, 3, 3" offset="6" size="1728"/>
			<output>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Constant_8690" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="Constant_4111, Convolution_115, Divide_4112, onnx::Conv_561"/>
				<attribute name="preprocessing" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Convolution_115" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4111, Convolution_115, Divide_4112, onnx::Conv_561"/>
				<attribute name="preprocessing" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>216</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>108</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Reshape_135_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="1734" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Reshape_135" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="input.1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_134, Reshape_135, input.1"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>108</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="input.1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>108</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="onnx::Conv_329" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Maximum_165, onnx::Conv_329"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>108</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_329">
					<dim>1</dim>
					<dim>32</dim>
					<dim>108</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Reshape_174_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="32, 1, 1, 3, 3" offset="1798" size="576"/>
			<output>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Reshape_174" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="GroupConvolution_240" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="GroupConvolution_240, Reshape_174"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>108</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>108</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Reshape_260_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="2374" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Reshape_260" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="input.4" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_259, Reshape_260, input.4"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>108</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="input.4">
					<dim>1</dim>
					<dim>32</dim>
					<dim>108</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="onnx::Conv_334" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Maximum_290, onnx::Conv_334"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>108</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_334">
					<dim>1</dim>
					<dim>32</dim>
					<dim>108</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="onnx::Conv_567_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="16, 32, 1, 1" offset="2438" size="1024"/>
			<output>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="onnx::Conv_567" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="onnx::Conv_567"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_567">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Convolution_292" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Convolution_292"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>108</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>108</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Reshape_312_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 16, 1, 1" offset="3462" size="32"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Reshape_312" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="input.8" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_311, Reshape_312, input.8"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>108</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="input.8">
					<dim>1</dim>
					<dim>16</dim>
					<dim>108</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="onnx::Conv_570_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="96, 16, 1, 1" offset="3494" size="3072"/>
			<output>
				<port id="0" precision="FP16">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="onnx::Conv_570" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="onnx::Conv_570"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_570">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Convolution_340" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Convolution_340"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>108</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>108</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Reshape_360_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 96, 1, 1" offset="6566" size="192"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Reshape_360" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="input.12" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_359, Reshape_360, input.12"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>108</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="input.12">
					<dim>1</dim>
					<dim>96</dim>
					<dim>108</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="onnx::Conv_341" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Maximum_390, onnx::Conv_341"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>108</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_341">
					<dim>1</dim>
					<dim>96</dim>
					<dim>108</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Reshape_399_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="96, 1, 1, 3, 3" offset="6758" size="1728"/>
			<output>
				<port id="0" precision="FP16">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Reshape_399" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="GroupConvolution_465" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="GroupConvolution_465, Reshape_399"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>108</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>54</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Reshape_485_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 96, 1, 1" offset="8486" size="192"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Reshape_485" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="input.16" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_484, Reshape_485, input.16"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>54</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="input.16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>54</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="onnx::Conv_346" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Maximum_515, onnx::Conv_346"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>54</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_346">
					<dim>1</dim>
					<dim>96</dim>
					<dim>54</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="onnx::Conv_576_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="24, 96, 1, 1" offset="8678" size="4608"/>
			<output>
				<port id="0" precision="FP16">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="onnx::Conv_576" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="onnx::Conv_576"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_576">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Convolution_517" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Convolution_517"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>54</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>54</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Reshape_537_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 24, 1, 1" offset="13286" size="48"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Reshape_537" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="input.20" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_536, Reshape_537, input.20"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>54</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="input.20">
					<dim>1</dim>
					<dim>24</dim>
					<dim>54</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="onnx::Conv_579_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="144, 24, 1, 1" offset="13334" size="6912"/>
			<output>
				<port id="0" precision="FP16">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="onnx::Conv_579" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="onnx::Conv_579"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_579">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Convolution_565" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Convolution_565"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>54</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>54</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Reshape_585_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 144, 1, 1" offset="20246" size="288"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Reshape_585" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="input.24" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_584, Reshape_585, input.24"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>54</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="input.24">
					<dim>1</dim>
					<dim>144</dim>
					<dim>54</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="onnx::Conv_353" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Maximum_615, onnx::Conv_353"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>54</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_353">
					<dim>1</dim>
					<dim>144</dim>
					<dim>54</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Reshape_624_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="144, 1, 1, 3, 3" offset="20534" size="2592"/>
			<output>
				<port id="0" precision="FP16">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Reshape_624" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="GroupConvolution_690" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="GroupConvolution_690, Reshape_624"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>54</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>54</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Reshape_710_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 144, 1, 1" offset="23126" size="288"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Reshape_710" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="input.28" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_709, Reshape_710, input.28"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>54</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="input.28">
					<dim>1</dim>
					<dim>144</dim>
					<dim>54</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="onnx::Conv_358" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Maximum_740, onnx::Conv_358"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>54</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_358">
					<dim>1</dim>
					<dim>144</dim>
					<dim>54</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="onnx::Conv_585_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="24, 144, 1, 1" offset="23414" size="6912"/>
			<output>
				<port id="0" precision="FP16">
					<dim>24</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="onnx::Conv_585" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="onnx::Conv_585"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>24</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_585">
					<dim>24</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Convolution_742" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Convolution_742"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>54</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>54</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Reshape_762_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 24, 1, 1" offset="30326" size="48"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Reshape_762" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="onnx::Add_584" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_761, Reshape_762, onnx::Add_584"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>54</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="onnx::Add_584">
					<dim>1</dim>
					<dim>24</dim>
					<dim>54</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="input.32" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="input.32"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>54</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>54</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="input.32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>54</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="onnx::Conv_588_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="144, 24, 1, 1" offset="30374" size="6912"/>
			<output>
				<port id="0" precision="FP16">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="onnx::Conv_588" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="onnx::Conv_588"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_588">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Convolution_791" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Convolution_791"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>54</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>54</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Reshape_811_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 144, 1, 1" offset="37286" size="288"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Reshape_811" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="input.36" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_810, Reshape_811, input.36"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>54</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="input.36">
					<dim>1</dim>
					<dim>144</dim>
					<dim>54</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="onnx::Conv_366" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Maximum_841, onnx::Conv_366"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>54</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_366">
					<dim>1</dim>
					<dim>144</dim>
					<dim>54</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Reshape_850_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="144, 1, 1, 3, 3" offset="37574" size="2592"/>
			<output>
				<port id="0" precision="FP16">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Reshape_850" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="GroupConvolution_916" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="GroupConvolution_916, Reshape_850"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>54</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>27</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Reshape_936_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 144, 1, 1" offset="40166" size="288"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Reshape_936" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="input.40" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_935, Reshape_936, input.40"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>27</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="input.40">
					<dim>1</dim>
					<dim>144</dim>
					<dim>27</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="onnx::Conv_371" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Maximum_966, onnx::Conv_371"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>27</dim>
					<dim>48</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_371">
					<dim>1</dim>
					<dim>144</dim>
					<dim>27</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="onnx::Conv_594_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="32, 144, 1, 1" offset="40454" size="9216"/>
			<output>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="onnx::Conv_594" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="onnx::Conv_594"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_594">
					<dim>32</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Convolution_968" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Convolution_968"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>27</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>27</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Reshape_988_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="49670" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Reshape_988" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="input.44" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_987, Reshape_988, input.44"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>27</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="input.44">
					<dim>1</dim>
					<dim>32</dim>
					<dim>27</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="onnx::Conv_597_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="192, 32, 1, 1" offset="49734" size="12288"/>
			<output>
				<port id="0" precision="FP16">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="onnx::Conv_597" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="onnx::Conv_597"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_597">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Convolution_1016" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Convolution_1016"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>27</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>27</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Reshape_1036_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 192, 1, 1" offset="62022" size="384"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Reshape_1036" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="input.48" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_1035, Reshape_1036, input.48"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>27</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="input.48">
					<dim>1</dim>
					<dim>192</dim>
					<dim>27</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="onnx::Conv_378" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Maximum_1066, onnx::Conv_378"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>27</dim>
					<dim>48</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_378">
					<dim>1</dim>
					<dim>192</dim>
					<dim>27</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Reshape_1075_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="192, 1, 1, 3, 3" offset="62406" size="3456"/>
			<output>
				<port id="0" precision="FP16">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Reshape_1075" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="GroupConvolution_1141" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="GroupConvolution_1141, Reshape_1075"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>27</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>27</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Reshape_1161_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 192, 1, 1" offset="65862" size="384"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Reshape_1161" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="input.52" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_1160, Reshape_1161, input.52"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>27</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
